#+TITLE: Introduction to Computing 
#+LANGUAGE: en
#+OPTIONS: num:nil toc:nil \n:nil @:t ::t |:t ^:t *:t TeX:t LaTeX:t ':t d:(not "HELP" "HINT")
#+STARTUP: showeverything entitiespretty
#+REVEAL_ROOT: https://cdn.jsdelivr.net/reveal.js/3.0.0/

* Some string-matching basics

#+name: containsGAGA
#+BEGIN_SRC python :results silent :session
  def containsGAGA(inString):
    if 'GAGA' in inString:
      return 'yes'
    else:
      return 'no'
#+END_SRC

#+BEGIN_SRC python :results output :noweb eval
  <<containsGAGA>>
  print(containsGAGA('ABGAGHI'))
#+END_SRC

#+RESULTS:
: no

#+BEGIN_SRC python :results output :noweb eval
  <<containsGAGA>>
  print(containsGAGA('ABGAGAI'))
#+END_SRC

#+RESULTS:
: yes

#+BEGIN_SRC python :results output :session
  print(containsGAGA('ABGAGAI'))
#+END_SRC

#+RESULTS:
: Traceback (most recent call last):
:   File "<stdin>", line 1, in <module>
: NameError: name 'containsGAGA' is not defined
: 
: 

#+name: contGAGA
#+BEGIN_SRC elisp :results silent
  (defun contains-GAGA? (in-string)
    (if (string-match "GAGA" in-string)
        "Yes"
      "No"))
#+END_SRC

#+BEGIN_SRC elisp
  (org-sbe contGAGA)
  (contains-GAGA? "ABGAGHI")
#+END_SRC

#+BEGIN_SRC elisp
  (contains-GAGA? "ABGAGAI")
#+END_SRC

*** Therefore, a SISO program can receive and return large multiline blocks of text

#+BEGIN_SRC python :results silent
  def countLines(inString):
    # split on newlines
    lines = inString.split('\n')
    # return the number of lines as a string
    return str(len(lines))
#+END_SRC

#+BEGIN_SRC elisp :results silent
  (defun count-lines (in-string)
    (let ((lines (split-string in-string "\n")))
      (number-to-string (length lines)))) 
#+END_SRC

#+BEGIN_SRC elisp
  (string-to-number "A" 16)
#+END_SRC

#+RESULTS:
: 10
